#+title: Queueing Theory and Simulation, lecture 12
#+author: Nicky van Foreest
#+date: \today
#+email: n.d.van.foreest@rug.nl

#+options: H:2 email:t num:t tex:t toc:t LaTeX:t
#+language: en
#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [bigger]
# +beamer_theme: Copenhagen
#+beamer_theme: metropolis

#+include: preamble.org
#+PROPERTY: header-args  :session  :exports both :results output


** Method 1: results

#+begin_src python
labda, mu = 1, 3
f = np.array([0, 1, 1, 1])
f = f / f.sum()

pi = compute_pi(f, M=10)
EL = sum(n * pi[n] for n in range(len(pi)))
print(EL)
#+end_src

#+RESULTS:
: 2.50106263812782

** Improvement strategy
#+begin_src python
M, EL_old, EL, eps = 0, 0, 1, 1 / 1000

while abs(EL - EL_old) > eps:
    EL_old = EL
    M += 10
    pi = compute_pi(f, M)
    EL = sum(n * pi[n] for n in range(len(pi)))
    print(M, EL)
#+end_src

#+RESULTS:
: 10 2.50106263812782
: 20 3.192263706141827
: 30 3.313502258623275
: 40 3.330813731920645
: 50 3.333031676154311
: 60 3.333298579652413

